In [1]:
a = 7
b = 5
a + b

12

In [2]:
import pandas as pd
import numpy as np 
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(data)
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [3]:
# Conditional Selection
# Selecting rows based on conditions
# df.loc[df['Age'] > 28]  # Select rows where 'Age' > 28
# create a new dataframe with list

df.loc[df['City'] == 'New York']  # Select rows where 'City' is 'New York'
df.loc[(df['Age'] > 28) & (df['City'] == 'New York')]  # Select rows where 'Age' > 28 AND 'City' is 'New York'

Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []